<!--
 * @Date: 2024-04-28 17:42:58
 * @LastEditTime: 2024-04-28 17:48:39
 * @Description:
-->
<!--
 * @Date: 2024-04-28 17:42:58
 * @LastEditTime: 2024-04-28 17:44:11
 * @Description:
-->
<route lang="json5" type="page">
{
  layout: "default",
  style: {
    navigationBarTitleText: "用户协议",
  },
}
</route>

<template>
  <view class="user-agreement">
    <view class="my-div">
      <view>
        <view class="title">一、总则</view>
        <view>1. 本协议的目的是明确用户使用微信小程序所应遵守的规定和义务。</view>
        <view>2. 用户在注册和使用微信小程序时必须提供真实、准确、完整的信息。</view>
        <view>3. 用户应遵守国家法律法规和微信小程序平台的规定。</view>
      </view>
      <view>
        <view class="title">二、用户注册和使用</view>
        <view>1. 用户在注册和使用微信小程序时必须提供真实的个人信息。</view>
        <view>2. 用户应妥善保管自己的账号和密码，避免泄露给第三方。</view>
        <view>3. 用户不得使用微信小程序进行任何违法、违规或侵犯他人权益的行为。</view>
      </view>
      <view>
        <view class="title">三、个人信息保护</view>
        <view>1. 微信小程序将采取合理、必要的安全措施保护用户的个人信息。</view>
        <view>2. 未经用户同意，微信小程序不会泄露用户的个人信息给第三方。</view>
        <view>3. 如果发现任何非法获取或使用用户个人信息的行为，微信小程序将立即采取措施并通知用户。</view>
      </view>
      <view>
        <view class="title">四、数据共享与隐私政策</view>
        <view>1. 微信小程序可能会收集、使用和共享用户在使用微信小程序过程中产生的数据。</view>
        <view>2. 微信小程序将遵循国家法律法规和平台规定保护用户的隐私。</view>
        <view>3. 用户可以通过微信个人中心设置自己的隐私偏好和数据共享设置。</view>
      </view>
      <view>
        <view class="title">五、知识产权保护</view>
        <view>1. 微信小程序及其关联公司拥有本协议中使用的所有商标、标识、专利、著作权等知识产权。</view>
        <view>2. 用户在使用微信小程序时不得侵犯微信小程序及其关联公司的知识产权。</view>
        <view>3. 如果发现任何侵犯知识产权的行为，微信小程序有权采取措施并通知用户。</view>
      </view>
      <view>
        <view class="title">六、服务中断与变更</view>
        <view>1. 微信小程序有权因维护、升级等原因暂时中断或变更服务。</view>
        <view>2. 如果因不可抗力或其他原因导致服务中断或变更，微信小程序将尽力减少对用户的影响。</view>
        <view>3. 微信小程序保留随时修改本协议的权利，并将在修改后的协议中及时通知用户。</view>
      </view>
      <view>
        <view class="title">七、违约责任与解决争议</view>
        <view>1. 如果用户违反本协议的规定，微信小程序有权采取措施并通知用户纠正违约行为。</view>
        <view>2. 如果用户与微信小程序发生任何争议，应首先通过友好协商解决；协商不成的，可以向当地人民法院提起诉讼。</view>
      </view>
      <view>
        <view class="title">八、其他条款</view>
        <view>1. 本协议自用户接受之日起生效。</view>
        <view>2. 本协议的解释权归微信小程序所有。</view>
        <view>3. 本协议一式两份，用户和微信小程序各执一份，具有同等法律效力。</view>
      </view>
    </view>
  </view>
</template>

<script lang="ts" setup>
/// ///////////////////////////////////////////////////////////////////////////////
// #region ----变量等------------------------------------------------------------------

// #endregion ========================================================================
/// ///////////////////////////////////////////////////////////////////////////////
// #region ----初始化,生命周期等-------------------------------------------------------

// #endregion ========================================================================
/// //////////////////////////////////////////////////////////////////////////////////
// #region ----操作方法----------------------------------------------------------------

// #endregion ========================================================================
/// //////////////////////////////////////////////////////////////////////////////////
// #region ----其他方法----------------------------------------------------------------

// #endregion ========================================================================
/// /////////////////////////////////////////////////////////////////////////////////
</script>

<style lang="scss" scoped>
Page {
  background: #fff;
}
.user-agreement {
  width: 100%;
  display: flex;
  justify-content: center;
  .my-div {
    width: 90%;
    margin: auto;
    .title {
      font-size: 36rpx;
      font-weight: bold;
    }
  }
}
</style>
